DataProcessors/ОбновлениеСборников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>ОбновлениеСборников</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/Сборники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Сборники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сложность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СложностиСборников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСборника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаСборника</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БратьОтветыИзТекущегоСборника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ОбновлениеСборников/Forms/Форма0/Ext/Form/Module.bsl
// Заполняет в таблицу сборников данные с сайта.
&НаСервере
Процедура СчитатьДанныеСборниковССайта()
	Попытка
		СодержимоеФайла = ОбменССайтом.ПолучитьДанныеПаковНаСайте();
		Парсер = Новый ЧтениеXML;
		Парсер.УстановитьСтроку(СодержимоеФайла);
		Пока Парсер.Прочитать() Цикл
			Если Парсер.ТипУзла = ТипУзлаXML.НачалоЭлемента И Парсер.Имя = "Сборник" Тогда
				НоваяСтрока = ТаблицаСборников.Добавить();
				Пока Парсер.Прочитать() Цикл 
					Если Парсер.ТипУзла = ТипУзлаXML.НачалоЭлемента И Парсер.Имя = "Наименование" Тогда                
						Парсер.Прочитать();
						Если Парсер.ТипУзла = ТипУзлаXML.Текст Тогда
							НоваяСтрока.НаименованиеСборника = Парсер.Значение;
						Иначе
							// Выполяем далее.
						КонецЕсли;  
					ИначеЕсли Парсер.ТипУзла = ТипУзлаXML.НачалоЭлемента И Парсер.Имя = "Версия" Тогда                
						Парсер.Прочитать();
						Если Парсер.ТипУзла = ТипУзлаXML.Текст Тогда
							НоваяСтрока.ДоступнаяВерсия = Парсер.Значение;
						Иначе
							// Выполяем далее.
						КонецЕсли;  
					ИначеЕсли Парсер.ТипУзла = ТипУзлаXML.НачалоЭлемента И Парсер.Имя = "ИдентификаторСборника" Тогда                
						Парсер.Прочитать();
						Если Парсер.ТипУзла = ТипУзлаXML.Текст Тогда
							НоваяСтрока.ИдентификаторСборника = Парсер.Значение;
						Иначе
							// Выполяем далее.
						КонецЕсли; 
					ИначеЕсли Парсер.ТипУзла = ТипУзлаXML.НачалоЭлемента И Парсер.Имя = "ИмяФайла" Тогда                
						Парсер.Прочитать();
						Если Парсер.ТипУзла = ТипУзлаXML.Текст Тогда
							НоваяСтрока.ИмяФайла = Парсер.Значение;
						Иначе
							// Выполяем далее.
						КонецЕсли;  
					ИначеЕсли Парсер.ТипУзла = ТипУзлаXML.КонецЭлемента И Парсер.Имя = "Сборник" Тогда
						Прервать;
					Иначе
						// Неизвестный вариант.
					КонецЕсли;	
				КонецЦикла;
			Иначе
				// Неизвестный вариант.
			КонецЕсли;
		КонецЦикла;
		Парсер.Закрыть();
	Исключение
		ТекстСообщения = НСтр("ru = 'При обновлении данных сборников с сайта произошли ошибки: %ОписаниеОшибки%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки());
		Сообщить(ТекстСообщения);
	КонецПопытки;	
КонецПроцедуры		// СчитатьДанныеСборниковССайта()	

// Добавляет в таблицу сборников данные сборников текущей базы.
&НаСервере
Процедура СчитатьДанныеСборниковИзБазы()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сборники.Ссылка,
		|	Сборники.Версия,
		|	Сборники.Наименование,
		|	Сборники.ИдентификаторСборника
		|ИЗ
		|	Справочник.Сборники КАК Сборники
		|ГДЕ
		|	НЕ Сборники.ПометкаУдаления";
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Найдено = Ложь;
		Для Каждого ТекТаблицаСборников Из ТаблицаСборников Цикл
			Если ТекТаблицаСборников.ИдентификаторСборника = ВыборкаДетальныеЗаписи.ИдентификаторСборника Тогда
				ТекТаблицаСборников.УстановленнаяВерсия	 = ВыборкаДетальныеЗаписи.Версия;
				ТекТаблицаСборников.СборникСсылка		 = ВыборкаДетальныеЗаписи.Ссылка;
				Найдено = Истина;
			Иначе
				// Выполняем поиск далее.
			КонецЕсли;	
		КонецЦикла;	
		Если Не Найдено Тогда
			НоваяСтрока = ТаблицаСборников.Добавить();
			НоваяСтрока.НаименованиеСборника	 = ВыборкаДетальныеЗаписи.Наименование;
			НоваяСтрока.УстановленнаяВерсия		 = ВыборкаДетальныеЗаписи.Версия;
			НоваяСтрока.ИдентификаторСборника	 = ВыборкаДетальныеЗаписи.ИдентификаторСборника;
			НоваяСтрока.СборникСсылка			 = ВыборкаДетальныеЗаписи.Ссылка;
		Иначе
			// Строка добавлена.
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры		// СчитатьДанныеСборниковИзБазы()

// Обновляет таблицу сборников согласно данным сайта и базы данных.
&НаСервере
Процедура ОбновитьТаблицуСборников_Сервер()
	ТаблицаСборников.Очистить();
	СчитатьДанныеСборниковССайта();
	СчитатьДанныеСборниковИзБазы();
	ТаблицаСборников.Сортировать("НаименованиеСборника возр");
КонецПроцедуры		// ОбновитьТаблицуСборников_Сервер()

// Загружает с сайта сборник с именем файла ИмяФайлаВход.
&НаСервере
Процедура ЗагрузитьСборникССайта(ИмяФайлаВход)
	Попытка
		АдресСтраницы = "";
		АдресСтраницы = АдресСтраницы + "http://livegig.ru/service/exam/";
		АдресСтраницы = АдресСтраницы + ИмяФайлаВход;
		СодержимоеАдреса = ОбменССайтом.ПолучитьСодержимоеВебАдреса(АдресСтраницы);
		Обработки.ПереносСборников.ЗагрузитьСборник_Сервер("", СодержимоеАдреса);
		ОбновитьТаблицуСборников_Сервер();
	Исключение
		ТекстСообщения = НСтр("ru = 'Не удалось загрузить файл %ИмяФайла%: %ОписаниеОшибки%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ИмяФайла%", Строка(ИмяФайлаВход));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки());
		Сообщить(ТекстСообщения);
	КонецПопытки;
КонецПроцедуры		// ЗагрузитьСборникССайта()

&НаКлиенте
Процедура ОбновитьТаблицуСборников(Команда)
	ОбновитьТаблицуСборников_Сервер();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСборник(Команда)
	ТекДанные = Элементы.ТаблицаСборников.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ПоказатьЗначение(, ТекДанные.СборникСсылка);
	Иначе
		// Строка не выбрана. Ничего не делаем.
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СкачатьСборник(Команда)
	ТекДанные = Элементы.ТаблицаСборников.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если ЗначениеЗаполнено(ТекДанные.ИмяФайла) Тогда
			ЗагрузитьСборникССайта(ТекДанные.ИмяФайла);
		Иначе
			Сообщить("Неизвестный сборник на сайте. Операция отменена.");
		КонецЕсли;
	Иначе
		Сообщить("Требуется выбрать сборник для продолжения. Операция отменена.");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьТаблицуСборников_Сервер(); 
КонецПроцедуры
